using Microsoft.EntityFrameworkCore.Migrations;

#nullable disable

namespace Market.Migrations
{
    /// <inheritdoc />
    public partial class AddOrderstatus : Migration
    {
        /// <inheritdoc />
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.AddColumn<int>(
                name: "OrderStatus",
                table: "Orders",
                type: "int",
                nullable: false,
                defaultValue: 0);

            object[,] data = new object[,]
            {
                {3,"Торты"},
                {4,"Хлеб"},
                {5,"Молочка"},
                {6,"Птица"},
                {7,"Колбасные"},
            };

            migrationBuilder.InsertData("Users", new[] { "Id", "Login", "Password", "Role" }, new object[,]
            {
                { 1, "Admin", "Admin", 0 },
                {2, "StoreWorker", "StoreWorker", 1},
                {3, "Worker", "Worker", 2}
            });

            migrationBuilder.InsertData("Categories", new[] { "Id", "Name" }, data);

            migrationBuilder.InsertData("Nomenclatures",
                new[] { "Id", "Name", "CategoryId", "SellPrice", "Description", "Count", "BuyPrice" }, new object[,]
                {
                    {
                        4, "Витчина Вкусная 1кг/Башкирия", 7, 381, "Колб изд Тараканова/Башкирия", 10, 300
                    },
                    {
                        5, "Ветчина Императорская вар 400гр/Башкирия", 7, 180, "Колб изд Тараканова/Башкирия", 10, 100
                    },
                    {
                        6, "Ветчина Куриная 1кг/Башкирия", 7, 361, "Колб изд Тараканова/Башкирия", 14, 300
                    },
                    {
                        9, "Ветчина Праздничная 1 кг/Башкирия", 7, 438, "Колб изд Тараканова/Башкирия", 15, 350
                    },
                    {
                        13, "Ветчина Столичная н/о 1кг /Башкирия", 7, 355, "Колб изд Тараканова/Башкирия", 20, 300
                    },
                    {
                        14, "Грудинка Столичная бескостная в/к 1кг/Башкирия", 7, 590, "Колб изд Тараканова/Башкирия",
                        13, 500
                    },
                    {
                        15, "Закуска Фермерская острая 1кг /Башкирия", 7, 579, "закуски", 15, 500
                    },
                    {
                        16, "Колбаса Бутербродная вареная 1кг/Башкирия", 7, 247, "Колб изд Тараканова/Башкирия", 15, 150
                    },
                    {
                        17, "Колбаса В дорогу вареная 1кг/Башкирия", 7, 259, "Колб изд Тараканова/Башкирия", 16, 200
                    },
                    {
                        18, "Бедро ЦБ охл ГОСТ подл 1кг", 6, 229, "Бедро охл", 12, 200
                    },
                    {
                        19, "Голень ЦБ охл подл 1кг", 6, 306, "Голень", 11, 200
                    },
                    {
                        20, "Грудка ЦБ охл подл 1кг", 6, 390, "Грудка", 17, 300
                    },
                    {
                        21, "Грудная кость цыпленка-бройлера охл 1 кг", 6, 91,
                        "Кости (спинки, грудн.кости, наборы кур)", 16, 30
                    },
                    {
                        22, "Желудок ЦБ мышечный охл подложка 1кг", 6, 202, "Желудок кур охл", 18, 150
                    },
                    {
                        23, "Крылышки куриные БАФФАЛО (в лотке с МГС) охл.", 6, 229, "Шашлыки", 21, 200
                    },
                    {
                        24, "Крылышки куриные Пикантные(в лотке с МГС), охл.", 6, 245, "Шашлыки", 14, 200
                    },
                    {
                        25, "Крылышки ЦБ охл подл 1кг", 6, 319, "Крылышко", 13, 250
                    },
                    {
                        29, "Набор для бульона из мяса птицы охл подл 1 кг", 6, 91,
                        "Кости (спинки, грудн.кости, наборы кур)", 11, 30
                    },
                    {
                        31, "БЗМЖ Йогурт 2,5%  мол. Вишня 0,5л м/у", 5, 49, "Йогурты питьевые в м/у", 17, 20
                    },
                    {
                        32, "БЗМЖ Йогурт 2,5%  мол. Земляника 0,5л м/у", 5, 49, "Йогурты питьевые в м/у", 19, 20
                    },
                    {
                        33, "БЗМЖ Йогурт 2,5%  мол. Черника 0,5л м/у", 5, 49, "Йогурты питьевые в м/у", 12, 20
                    },
                    {
                        34, "БЗМЖ Йогурт с ФЯН киви-виноград  2,5% 120гр ст", 5, 33, "Йогурты питьевые в бутылке", 16,
                        19
                    },
                    {
                        36, "БЗМЖ Йогурт с ФЯН клуб-земл 2,5% 400гр ст", 5, 58, "Йогурты питьевые в бутылке", 18, 40
                    },
                    {
                        37, "БЗМЖ Йогурт с ФЯН персик-манго 2,5% 400гр", 5, 58, "Йогурты питьевые в бутылке", 22, 40
                    },
                    {
                        38, "БЗМЖ Кефир 2,5% 0,5л м/у /Нытвенский МЗ", 5, 39, "Кефир 2,5-3,2%", 26, 20
                    },
                    {
                        39, "БЗМЖ Кефир 2,5% 0,9л м/у /Нытвенский МЗ", 5, 75, "Кефир 2,5-3,2%", 13, 60
                    },
                    {
                        40, "БЗМЖ Кефир 3,2% 0,9л м/у/Нытвенский", 5, 85, "Кефир 2,5-3,2%", 17, 60
                    },
                    {
                        41, "Багет французкий 250 гр/Новрузов", 4, 39, "БАТОН цельный", 19, 20
                    },
                    {
                        42, "Батон Здоровье 2/с 400гр /ИП Новрузов", 4, 35, "БАТОН цельный", 23, 20
                    },
                    {
                        43, "Батон Нарезной в/с 300гр /ИП Новрузов", 4, 33, "БАТОН цельный", 20, 20
                    },
                    {
                        44, "Батон Нарезной в/с нарезка 300гр /ИП Новрузов", 4, 36, "БАТОН цельный", 12, 20
                    },
                    {
                        45, "Батон Особый в/с 400гр /ИП Новрузов", 4, 37, "БАТОН цельный", 18, 20
                    },
                    {
                        46, "Лаваш в/с 300гр /ИП Новрузов", 4, 31, "Лаваш", 30, 20
                    },
                    {
                        47, "Лаваш в/с 500гр /ИП Новрузов", 4, 39, "Лаваш", 35, 20
                    },
                    {
                        48, "Лаваш тонкий 40 см 80гр /ИП Новрузов", 4, 13, "Лаваш", 12, 10
                    },
                    {
                        49, "Лаваш тонкий Для Ролл 60 см /ИП Новрузов", 4, 16, "Лаваш", 17, 10
                    },
                    {
                        51, "Хлеб Ботанический форм 350гр /ИП Новрузов", 4, 35, "ХЛЕБ цельный", 13, 20
                    },
                    {
                        52, "Пирожное Волшебная горка 240 гр/Рада", 3, 129, "Пирожное скоропорт группа", 19, 100
                    },
                    {
                        53, "Пирожное Ёжик 260 гр/Рада", 3, 126, "Пирожное скоропорт группа", 28, 100
                    },
                    {
                        54, "Пирожное Золотые облака 240 гр/Рада", 3, 125, "Пирожное скоропорт группа", 17, 100
                    },
                    {
                        55, "Пирожное Именинница 240г/Рада", 3, 167, "Пирожное скоропорт группа", 16, 100
                    },
                    {
                        56, "Пирожное Розовый бархат 240г/Рада", 3, 147, "Пирожное скоропорт группа", 16, 100
                    },
                    {
                        57, "Пирожное Тет-а-Тет 240 гр/Рада", 3, 129, "Пирожное скоропорт группа", 15, 100
                    },
                    {
                        58, "Торт Ванильно-клубничный 540гр", 3, 270, "Торты скоропорт группа", 14, 200
                    },
                    {
                        59, "Торт Венский 800гр", 3, 375, "Торты скоропорт группа", 10, 250
                    },
                    { 61, "Торт Восточные сказки 850 гр", 3, 538, "Торты скоропорт группа", 6, 450 }

                });
        }

        /// <inheritdoc />
        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DropColumn(
                name: "OrderStatus",
                table: "Orders");
        }
    }
}
